In [10]:
import numpy as np
import pandas as pd

In [18]:
dataFrame = pd.read_csv("E:\\pandas\\practice.csv")

In [21]:
print("My file : \n", dataFrame)

My file :
    Unnamed: 0   name  marks    city
0           0    one     12     chd
1           1    two     45  mohali
2           2  three     67   zirak
3           3   four     89  panchk

In [26]:
dataFrame = pd.read_csv("E:\\pandas\\practice.csv", header=None, names=["hello", "hii", "col3",
"col4"], na_values=["Not avail"])

In [29]:
dataFrame

   hello    hii   col3    col4
0    NaN   name  marks    city
1    0.0    one     12     chd
2    1.0    two     45  mohali
3    2.0  three     67   zirak
4    3.0   four     89  panchk